[
    {
        "title": "S.E.T.I",
        "description": "A SETI engineer discovers a message that undermines the three Abrahamic religions, hides the evidence, and confides in his priest — only for those involved to die mysteriously, forcing him to flee for his life.",
        "chapterPreview": "Colonel Kristoff Graff walked slowly across St Peter’s Square. he was absolutely gobsmacked at the task that Father Guido had just assigned him. Murder! Made to look like natural causes or accidents!. Kristoff was six feet tall 195 lb and 35 years old. He was single as required by the Catholic Church and he had been in the Swiss guard for 15 years. He had applied for and joined the guard with strong religious fervor and a belief that he would be doing God’s work. He wanted to Serve and Protect and had done his utmost to live a very religious existence being true to all the tenants of Christianity. Now he was given a list with five names, Cardinal Allen Gregory , Archbishop Antonio Gutierrez, Bishop Joseph Whalen, A monsignor Sambor and a father David Ales. He was also instructed to determine the name of the person that had initially contacted Fr. David Ailes On September 9th of this year and to eliminate him in the same manner as he was instructed to eliminate the list of clergy.\nThe colonel had strong misgivings on this task but given father Guido’s obvious discomfort and anxiety while presenting the mission to him Colonel Graf resolved that this must be an extremely important mission that he was destined to accomplish. He reached his office and told the receptionist that he did not want to be disturbed for the next hour. He entered his office, closed and locked the door and then sat facing the small window through which he could see the crown of an  old Italian Cypress tree. Birds were coming and going in the tree and there was not a cloud in the sky. the image calmed him and he began considering how to accomplish the task at hand\nThe Catholic Church is a unique organization in the world. it is the only religious organization to actually have Sovereign territory. in addition it had all of the organs of a full-blown civilian government including military and health departments, museums, research facilities Etc. More importantly even than this, the Catholic Church owns substantial property in all of the major cities of the world, has embassies to most of the major governments of the world and even a seat at the United Nations. This last is as a non-voting member but nevertheless gives the church access to an enormous Network of people, places and things. All of these assets would be available to the colonel in his quest to satisfy the pontiff’s instructions. In addition he had the Swiss guard , a force of 135 highly trained and highly educated men entirely dedicated to the Catholic Church.\nThere were also more than 1 million priests, nuns, monks and other members of the Catholic church’s membership specifically dedicated to working for the church. Lastly, Catholicism counted nearly 1 billion lay members. Of course the admonition of extreme secrecy Limited Colonel Graf to those that he knew and personally trusted but he could rely on The enormous resources of the church to help him accomplish his goals. The trick then was going to be how to accomplish them rapidly and without raising any unnecessary suspicions.\nHis first Target would be Cardinal Alan Gregory who resided in a small apartment on the grounds of the Vatican. Not only was the Cardinal near at hand but Colonel Graff would control the investigation of his death. At 69 the Cardinal was not a young man but his apparent robust health did present some restrictions and presenting his death as being a natural cause might prove difficult. The colonel immediately decided that a staged suicide would probably be his best bet as it would require no assistance from others and so no conspiracies with other members of the Swiss guard. There was the additional advantage that he would be the first notified by those that found the Cardinal and would therefore have a hand in the investigation.",
        "image": "img/SetiCover-scaled.png"
    },
    {
        "title": "Tales From The Bench",
        "description": "A compendium of short stories from my experiences as a city court judge.",
        "chapterPreview": "IN GOD WE TRUST” … OR NOT\nOccasionally, I encounter a truly scary defendant. Such was the case with Mr. M. He was brought in front of me for stalking a member of the local state troopers. Seriously, who stalks the state police? Mr. M looked quite capable of causing damage to almost anyone caught alone. In addition, Mr. M had prior military experience and consequently was familiar with firearms. In any case,he was caught trespassing on property that bordered the state police barracks. It was at a higher elevation than the barracks which allowed him a good view of the back side of the barracks and the parking lot. He had previously threatened a particular trooper whom he had encountered on the road in front of his home while the trooper was issuing a traffic ticket.\nUpon invitation, he appeared voluntarily in my court on the stalking charge. When I called his name he proceeded to walk up to the bar in front of my “bench.” He stopped and then turned his back to me. I expected that he was planning to hold court and air his grievances about government and law enforcement, but before he could say anything I asked him if there was a problem. He responded “Those words over your head hurt my eyes!” Now, on the wall behind me is written: “In God we trust.” You will find this in most courtrooms across the country. I am sure that eventually the anti religion people will have that removed, but for now it is there. I didn’t miss a beat and remarked “You’re very sensitive for such a large and robust looking man.”\nThe audience giggled. Mr. M was off balance now and though he never turned to face me he didn’t engage the audience either. I assigned him an attorney and adjourned the matter quickly so that he had no excuse for remaining in my court. I couldn’t see his face, but I could tell that he was at a loss as to what to do. Any planned speech or demonstration seemed to have left his mind. Three of my four security personnel all began approaching him at once.\nOne from his immediate left and two more from the courtroom entrance. He knew that he was done and started to move towards the exit. As he got close to the two officers approaching him he said “I’m leaving voluntarily.” They parted, one to each side to allow him to pass. The third officer resumed his position to my left and the other two followed Mr. M out of the court. He never appeared for his next court date and rumor has it that he has relocated to the Carolinas. I am not going to issue a warrant as long as he stays outside of New York State.",
        "image": "img/ComingSoon_cropped.png"
    },
    {
        "title": "T.O.K.M.A.K.",
        "description": "In this alternate history sci-fi, a man who channels electricity from a parallel universe battles government agencies seeking control of his invention, the TOKMAK device.",
        "chapterPreview": "I woke up again today!” That was the first thing that ran through his mind as he opened his eyes. This had become a familiar source of surprise to Mr M as he continued to gather years. The numbers were getting quite large. His overall health was pretty good and in fact some things were better than they were twenty years ago like his eyesight. Nevertheless time was building. An image of Gulliver came to mind with new threads being thrown across his body by time’s minions.  One for each year. How long until there were so many threads that he couldn’t overcome them and rise to the day? He pulled the sheet off of his body and swung his feet to the floor. The view out of the twelve foot tall windows was spectacular. The sunlight streaming in was rejuvenating.\nThis day, though beautiful, was like any other day for Mr M however without much to do. He did have obligations to start or restart TOKMAK’s all over the world but the process had become so routine for him that it was pretty easy to keep up with the schedule and get dozens of them started each day. This necessitated a pretty constant travel schedule but since he could teleport to wherever he needed to be the travel became almost negligible and he found himself sleeping in his own bed in Bariloche or Tarnov nearly every night. He no longer needed a private airplane and sold what he had earlier used. He did manage a netjets account so that his employees could manage more easily. He did enjoy spending time on ISHKA but he did not need the boat for travel or accommodation just for pleasure. He often took ISHKA and “jumped” to cool places where he could just cruise quietly and uninterrupted while enjoying the scenery. Once he was nearing Socotra off the Horn of Africa.\nHe was fascinated by the dragon trees on the island, a very unique and interesting looking tree that grew there in the arid climate. As he was drifting along viewing the dragon trees crowning the cliffs two fast boats began heading straight towards him. The boats did not bear any markings indicating that they were government or military and they looked menacing. As they drew closer he could see mounted guns and a dozen or so men on each boat, some brandishing rifles. His first thought was to turn and run. There was not a lot of doubt that he could outrun them or at least, with his TOKMAK system, outlast them in a chase. A warning shot was fired across his bow by one of the approaching boats. Mr M was alone on his boat, a 60 foot long Sunseeker Evo Predator. It was a fast looking boat, sleek and shiny. It could also cruise at just over 50 kts which was probably enough to outrun these larger diesel powered military style craft. But he couldn’t outrun gun fire and they were close enough already that drastic action was required. Accordingly he disappeared from the view of the pursuing boats jumping to a location a little off the coast of Chile near Antofagasta. Another beautiful place where , according to some article that he had read years before, the largest difference in elevation on Earth exists where the Andes mountains rise up from the Pacific which is over 25,000 feet deep where Mr M was currently.\nThe Andes also rise to above 20,000 feet in some places with Mount Aconcagua being the tallest at 22,800+ feet. The total difference in elevation is nearly nine full miles in some places and makes for a truly dramatic spectacle. It was night time in Chile but more importantly there was no pursuit. He set the autopilot to run North at about 5 kts and drifted back into the captain’s chair. He wasn’t tired; he just leaned back with his eyes closed and enjoyed the gentle rocking as the boat slowly plowed through a small Northwest swell that set up a rhythmic rocking of a few degrees from forward to port back to starboard and aft. Very slow measured in 2 or 3 seconds per cycle. Very relaxing in the 80 degree weather under a full moon.\nMaybe I should visit the Galapagos, he thought or just stay here for a few hours. Let’s hope that no one disturbs this reverie he thought and let his thoughts drift to days long past when he was strong and bulletproof. When nothing was physically hard and he was full of anticipation about the future. A future filling his life with a family and friends and work. What a contrast to where he was now. Alone with his only concern being how to maintain what he had. Maintain it for who? The world, he thought.",
        "image": "img/ComingSoon_cropped.png"
    }
]
