[
    {
        "heading": "Jordanville Library Speaking Engagement",
        "date": "September 12, 2025",
        "text": "I recently had the pleasure of giving my first library talk at the historic Jordanville Public Library. It was such a meaningful experience—made even more special by seeing my name on the library’s marquee sign! The Jordanville Library has a rich history, with Teddy Roosevelt and his family playing a key role in its founding and visiting frequently. 📸 Here’s a photo from the event!",
        "image": "img/471072528249319581-1080x675.jpg"
    },
    {
        "heading": "The Joe Kelly Show 7/27/25",
        "date": "July 27, 2025",
        "text": "Joe Kelly sits down with Mike Misiaszek, Oneida City Judge and local author who is out with a new book. They discuss his book, other upcoming projects, his career as a judge, and much more. Watch Now: <a href=https://www.cnyhomepage.com/video/the-joe-kelly-show-72725-with-mike-misiaszek/10929102> link </a>",
        "image": "img/JoeKellyShow-1080x675.png"
    },
    {
        "heading": "WKAL with Rocco Garro",
        "date": "Date Placeholder",
        "text": "Last Friday, I had the pleasure of joining Rocco Garro on his morning radio show at WKAL 1450 AM. We spent nearly an hour on air discussing The Anastasia Project, and it was an incredibly enjoyable experience.  Chatting with Roc brought back fond memories of when I campaigned for judge five years ago, and it was a pleasure to reconnect. Roc’s weekday morning show is a staple in the Mohawk Valley community, and his warm, engaging style made the conversation flow effortlessly.  During our talk, Roc mentioned that he’s excited to have me back when my book officially launches for more promotional visits — something I’m really looking forward to! He’s a true gem in our local community, and I’m grateful for the opportunity to share my work with his audience.  I may even have to surprise him with a signed copy of the book once the physical edition is available!  Stay tuned for more updates on The Anastasia Project and future appearances.",
        "image": "img/475977259_2857856767707657_8752420905825943408_n-1024x768.jpg"
    }
]